swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
#include "hal.h"
#include "hal_dram_scan.h"
#include "rtl8735b_dpi_type.h"
#include "hal_dram_init.h"
#include "hal_cache.h"

/*PLL Refrence clock is 40MHz*/
#define DDR_PLL_REF_CLK 40

#if DRAM_SCAN

const unsigned int dram_patterns[] = {
	0x01234567,
	0xfedcba98,
	0xA5A5A5A5,
	0x5A5A5A5A,
	0x5A5AA5A5,
	0xA5A55A5A,
};

uint8_t dram_normal_patterns(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t pattern_idx = 0, access_idx = 0;
	uint32_t start_value;
	uint32_t *write_start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start dram_normal_patterns test=======\r\n");
	for (pattern_idx = 0; pattern_idx < (sizeof(dram_patterns) / sizeof(uint32_t)); pattern_idx++) {
		/* write pattern */
		write_start = (uint32_t *)(dram_start + (pattern_idx * dram_size) % (area_size));
		test_start = write_start;

		read_start = (uint32_t *)((uint32_t) write_start + dram_size - 4);

		for (access_idx = 0; access_idx < dram_size; access_idx += 4) {
			*write_start = dram_patterns[pattern_idx];
			write_start++;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		//check data in reverse order
		for (access_idx = 0; access_idx < dram_size; access_idx += 4) {
			start_value = (*read_start);
			if (start_value != dram_patterns[pattern_idx]) {
				dbg_printf("[dram_normal_patterns test FAIL] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   read_start, start_value, dram_patterns[pattern_idx]);
				return _FAIL;
			} else {
				//dbg_printf("[dram_normal_patterns test PASS] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
				//    read_start, start_value, dram_patterns[pattern_idx]);
			}
			read_start--;
		}
	}

	//dbg_printf("dram_normal_patterns test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_addr_rot(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t idx;
	uint32_t offset;
	uint32_t start_value;
	uint32_t read_start_addr;
	uint32_t *start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start dram_addr_rot test=======\r\n");

	for (idx = 0; idx < 32; idx = idx + 4) {
		/*write pattern*/
		start = (uint32_t *)(dram_start + ((idx / 4) * dram_size) % (area_size));
		test_start = start;

		read_start = (uint32_t *)((uint32_t) start + dram_size - 4);
		read_start_addr = ((uint32_t) start);

		start = (uint32_t *)(((uint32_t) start));
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			*start = (read_start_addr << idx);
			start++;
			read_start_addr = read_start_addr + 4;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		read_start_addr = ((uint32_t) read_start);
		/*check data reversing order*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != ((read_start_addr) << idx)) {
				dbg_printf("[addr_rot FAIL]Reverse order Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   read_start, start_value, ((read_start_addr) << idx));
				return _FAIL;
			}
			read_start_addr = read_start_addr - 4;
			read_start--;
		}

		read_start_addr += 4;
		read_start++;

		/*check data sequential order*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != ((read_start_addr) << idx)) {
				dbg_printf("[addr_rot FAIL]Sequential order Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   read_start, start_value, ((read_start_addr) << idx));
				return _FAIL;
			}
			read_start_addr = read_start_addr + 4;
			read_start++;
		}

		//dbg_printf("rotate %d 0x%x pass\r\n", idx, (uint32_t)start);
	}

	//dbg_printf("dram_addr_rot test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_com_addr_rot(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t idx;
	uint32_t offset;
	uint32_t start_value;
	uint32_t read_start_addr;
	uint32_t *start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start dram_com_addr_rot test=======\r\n");

	for (idx = 0; idx < 32; idx = idx + 4) {
		/*write pattern*/
		start = (uint32_t *)(dram_start + ((idx / 4) * dram_size) % (area_size));
		test_start = start;

		read_start = (uint32_t *)((uint32_t) start + dram_size - 4);
		read_start_addr = ((uint32_t) start);

		start = (uint32_t *)((uint32_t) start);
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			*start = ~(read_start_addr << idx);
			start++;
			read_start_addr = read_start_addr + 4;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		read_start_addr = ((uint32_t) read_start);
		/*check data reversing order*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != (~(read_start_addr << idx))) {
				dbg_printf("[com_addr_rot fail]Reverse order Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   read_start, start_value, ~((read_start_addr) << idx));
				return _FAIL;
			}
			read_start_addr = read_start_addr - 4;
			read_start--;
		}

		read_start_addr += 4;
		read_start++;

		/*check data sequential order*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != (~(read_start_addr << idx))) {
				dbg_printf("[com_addr_rot fail]Sequential order Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   read_start, start_value, ~((read_start_addr) << idx));
				return _FAIL;
			}
			read_start_addr = read_start_addr + 4;
			read_start++;
		}

		//dbg_printf("~rotate %d 0x%x pass\r\n", idx, (uint32_t)start);
	}

	//dbg_printf("dram_com_addr_rot test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_byte_access(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint8_t byte;
	uint32_t idx;
	uint32_t offset;
	uint32_t start_value;

	uint8_t *start_b, *test_start;
	uint32_t *start_w;

	//dbg_printf("\r\n=======start dram_byte_access test=======\r\n");

	for (idx = 0; idx < (sizeof(dram_patterns) / sizeof(uint32_t)); idx++) {
		/*write byte pattern*/
		start_w = (uint32_t *)(dram_start + (idx * dram_size) % (area_size) + dram_size - 4);
		start_b = (uint8_t *)(dram_start + (idx * dram_size) % (area_size));
		test_start = start_b;

		for (offset = 0; offset < dram_size; offset = offset + 4) {
			byte = (uint8_t)(dram_patterns[idx] >> 24);
			*(start_b + 3) = byte;
			byte = (uint8_t)(dram_patterns[idx] >> 16);
			*(start_b + 2) = byte;
			byte = (uint8_t)(dram_patterns[idx] >> 8);
			*(start_b + 1) = byte;
			byte = (uint8_t)(dram_patterns[idx]);
			*(start_b) = byte;

			start_b += 4;
		}

		dcache_clean_by_addr(test_start, dram_size);

