swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
		dcache_invalidate_by_addr(test_start, dram_size);

		/* read word and check data */
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = *start_w;
			if (start_value != dram_patterns[idx]) {
				dbg_printf("[byte_access fail] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n", start_w, start_value, dram_patterns[idx]);
				return _FAIL;
			}
			start_w--;
		}
		//dbg_printf("pattern[%d](0x%x) 0x%x pass\r\n", idx, dram_patterns[idx], start_b);
	}
	//dbg_printf("dram_byte_access test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_half_word_access(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint16_t h_word;
	uint32_t idx;
	uint32_t offset;
	uint32_t start_value;

	uint16_t *start_h, *test_start;
	uint32_t *start_w;

	//dbg_printf("\r\n=======start dram_half_word_access test=======\r\n");
	for (idx = 0; idx < (sizeof(dram_patterns) / sizeof(uint32_t)); idx++) {
		/*write half_word pattern*/
		start_h = (uint16_t *)(dram_start + (idx * dram_size) % (area_size));
		test_start = start_h;
		start_w = (uint32_t *)(dram_start + (idx * dram_size) % (area_size) + dram_size - 4);

		for (offset = 0; offset < dram_size; offset = offset + 4) {
			h_word = (uint16_t)(dram_patterns[idx] >> 16);
			*(start_h + 1) = h_word;
			h_word = (uint16_t)(dram_patterns[idx]);
			*(start_h) = h_word;

			start_h += 2;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		/*read work and check data*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*start_w);
			if (start_value != dram_patterns[idx]) {
				dbg_printf("[half_word_access fail] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n", start_w, start_value, dram_patterns[idx]);
				return _FAIL;
			}
			start_w--;
		}
		//dbg_printf("pattern[%d](0x%x) 0x%x pass\r\n", idx, dram_patterns[idx], start_h);
	}
	//dbg_printf("dram_half_word_access test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_walking_of_1(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t idx;
	uint32_t offset;

	uint32_t walk_pattern;
	uint32_t start_value;
	uint32_t *start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start dram_walking_of_1 test=======\r\n");
	for (idx = 0; idx < 32; idx++) {
		/*generate pattern*/
		walk_pattern = (1 << idx);

		/*write pattern*/
		start = (uint32_t *)(dram_start + (idx * dram_size) % (area_size));
		test_start = start;

		read_start = (uint32_t *)(((uint32_t) start + dram_size - 4));
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			*start = walk_pattern;
			start++;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		/*check data*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != walk_pattern) {
				dbg_printf("[walking_of_1 fail] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n", read_start, start_value, walk_pattern);
				//dbg_printf("FAIL!\r\n");
				return _FAIL;
			}
			read_start--;
		}
		//dbg_printf("pattern[%d](0x%x) 0x%x pass\r\n", idx, walk_pattern, start);
	}
	//dbg_printf("dram_walking_of_1 test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_walking_of_0(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t idx;
	uint32_t offset;

	uint32_t walk_pattern;
	uint32_t start_value;
	uint32_t *start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start dram_walking_of_0 test=======\r\n");
	for (idx = 0; idx < 32; idx++) {
		/*generate pattern*/
		walk_pattern = ~(1 << idx);

		/*write pattern*/
		start = (uint32_t *)(dram_start + (idx * dram_size) % (area_size));
		test_start = start;

		read_start = (uint32_t *)(((uint32_t) start + dram_size - 4));
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			*start = walk_pattern;
			start++;
		}

		dcache_clean_by_addr(test_start, dram_size);

		dcache_invalidate_by_addr(test_start, dram_size);

		/*check data*/
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != walk_pattern) {
				dbg_printf("[walking_of_0 fail] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n", read_start, start_value, walk_pattern);
				return _FAIL;
			}
			read_start--;
		}
		//dbg_printf("pattern[%d](0x%x) 0x%x pass\r\n", idx, walk_pattern, start);
	}
	//dbg_printf("dram_walking_of_0 test PASS!\r\n");
	return _SUCCESS;
}

uint8_t memcpy_test(uint32_t dram_start, uint32_t dram_size, uint32_t area_size)
{
	uint32_t idx;
	uint32_t offset;

	uint32_t start_value;
	uint32_t read_start_addr;
	uint32_t *start, *test_start;
	uint32_t *read_start;

	//dbg_printf("\r\n=======start memcpy_test test=======\r\n");
	for (idx = 0; idx < 32; idx = idx + 4) {
		/*write pattern*/
		start = (uint32_t *)(dram_start + (idx * dram_size) % (area_size));
		test_start = start;

		read_start_addr = ((uint32_t) start + (dram_size - 4));

		read_start = (uint32_t *)(((uint32_t) start + dram_size - 4));
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			*start = ((uint32_t) start << idx);
			start++;
		}

		dcache_clean_by_addr(test_start, dram_size);

		memcpy((uint8_t *)(dram_start + dram_size), (uint8_t *)(test_start), dram_size);

		dcache_clean_by_addr(dram_start + dram_size, dram_size);
		dcache_invalidate_by_addr(dram_start + dram_size, dram_size);

		/*check uncached data*/
#if 1
		read_start = (uint32_t *)(dram_start + dram_size + dram_size - 4);
		for (offset = 0; offset < dram_size; offset = offset + 4) {
			start_value = (*read_start);
			if (start_value != ((read_start_addr) << idx)) {
				dbg_printf("[memcpy test fail %d] Addr @0x%x = 0x%x, Pattern = 0x%x\r\n",
						   idx, read_start, start_value, ((read_start_addr) << idx));
				return _FAIL;
			}
			read_start = read_start - 1;
			read_start_addr = read_start_addr - 4;
		}
#endif
		//dbg_printf("memcpy %d 0x%x pass\r\n", idx, start);
	}

	//dbg_printf("memcpy_test test PASS!\r\n");
	return _SUCCESS;
}

uint8_t dram_access_long_run_test(void)
{
	uint32_t start_addr = DRAM_MEM_BASE + 0x0;

