swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
	//uint32_t test_size = 0x10000;
	uint32_t test_size = 0x4000000;
	u32 loop = 0;
	u32 start, end;
	dbg_printf("DRAM long run testing ...\r\n");
	while (1) {
		start = hal_read_cur_time();
		if (dram_normal_patterns(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}

#if 1
		if (dram_addr_rot(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		if (dram_com_addr_rot(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		//comment for code size
		if (dram_byte_access(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		if (dram_half_word_access(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		if (dram_walking_of_1(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		if (dram_walking_of_0(start_addr, test_size, test_size) == _FAIL) {
			return _FAIL;
		}
#endif

#if 1
		if (memcpy_test(start_addr, 0x2000000, 0x2000000) == _FAIL)
			//if(memcpy_test(start_addr, test_size, test_size) == _FAIL)
		{
			return _FAIL;
		}
#endif
		end = hal_read_cur_time();
		//dbg_printf("Loop = %d Pass, period = %d\r\n", loop++, end-start);
		dbg_printf("Loop = %d Pass\r\n", loop++);
	}
	return _SUCCESS;

}


uint8_t dram_access_test(void)
{
	uint32_t start_addr = DRAM_MEM_BASE + 0x0;

	uint32_t test_size = 0x10000;
	//uint32_t test_size = 0x4000000;
	u32 loop = 0;
	u32 start, end;
//while(1) {
	start = hal_read_cur_time();
	if (dram_normal_patterns(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}

#if 1
	if (dram_addr_rot(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	if (dram_com_addr_rot(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	//comment for code size
	if (dram_byte_access(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	if (dram_half_word_access(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	if (dram_walking_of_1(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	if (dram_walking_of_0(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif

#if 1
	//if(memcpy_test(start_addr, 0x2000000, 0x2000000) == _FAIL)
	if (memcpy_test(start_addr, test_size, test_size) == _FAIL) {
		return _FAIL;
	}
#endif
	end = hal_read_cur_time();
	//dbg_printf("Loop = %d Pass, period = %d\r\n", loop++, end-start);
//}
	return _SUCCESS;

}

void dram_odt_alwayson(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;

	//ODT always on
	dpi_dev_map->DPI_READ_CTRL2 |= (DPI_BIT_ODT_FORCE_SEL | DPI_BIT_ODT_FORCE_SIG);
	dpi_dev_map->DPI_READ_CTRL2_1 |= (DPI_BIT_ODT_FORCE_SEL | DPI_BIT_ODT_FORCE_SIG);
}

void dram_scan_rd_dly(u32 reg_index, u32 byte_index)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 delay_index;
	u32 *addr = (&dpi_dev_map->DPI_DQS_IN_DLY0) + reg_index;
	u32 backup = *addr;

	dbg_printf("addr %x byte %x, value = %x\r\n", addr, byte_index, *addr);
	for (delay_index = 0; delay_index < 32; delay_index++) {
		cpu_read_modify_write(addr, delay_index << (byte_index * 8), 0x1F << (byte_index * 8));

		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _SUCCESS) {
			dbg_printf("%x pass.\r\n", delay_index);
		}
	}

	/*Retore to default value*/
	//*addr = 0x0A0A0A0A;
	*addr = backup;
}

void dram_scan_wr_dly(u32 reg_index, u32 shift_index)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 delay_index;
	u32 *addr = (&dpi_dev_map->DPI_DQ_DLY_0) + reg_index;

	dbg_printf("addr %x byte %x, value = %x\r\n", addr, shift_index, *addr);
	for (delay_index = 0; delay_index < 16; delay_index++) {
		cpu_read_modify_write(addr, delay_index << (shift_index * 4), 0xF << (shift_index * 4));

		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

		if (dram_access_test() == _SUCCESS) {
			dbg_printf("%x pass.\r\n", delay_index);
		}
	}

	/*Retore to default value*/
	*addr = 0x88888888;
}

void dram_calibration_dck_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 dck_pi = 0;
	u32 dck_dqs0, dck_dqs1, dck_dq0, dck_dq1;
	u32 count_hold = 0;
	u32 count_setup = 0;

	//dbg_printf("dpi_dev_map->DPI_PLL_PI0 = %x\r\n", dpi_dev_map->DPI_PLL_PI0);
	//dbg_printf("dpi_dev_map->DPI_PLL_PI1 = %x\r\n", dpi_dev_map->DPI_PLL_PI1);
	//dbg_printf("dpi_dev_map->DPI_PLL_PI2 = %x\r\n", dpi_dev_map->DPI_PLL_PI2);

	dck_pi = dpi_dev_map->DPI_PLL_PI0 & DPI_MASK_POST_PI_SEL0;

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

	dck_dqs0 = dck_pi - ((dpi_dev_map->DPI_PLL_PI0 & DPI_MASK_POST_PI_SEL2) >> DPI_SHIFT_POST_PI_SEL2);
	dck_dqs1 = dck_pi - ((dpi_dev_map->DPI_PLL_PI0 & DPI_MASK_POST_PI_SEL3) >> DPI_SHIFT_POST_PI_SEL3);
	dck_dq0 = dck_pi - ((dpi_dev_map->DPI_PLL_PI1 & DPI_MASK_POST_PI_SEL6) >> DPI_SHIFT_POST_PI_SEL6);
	dck_dq1 = dck_pi - ((dpi_dev_map->DPI_PLL_PI2 & DPI_MASK_POST_PI_SEL7) >> DPI_SHIFT_POST_PI_SEL7);
	dbg_printf("dck_dqs0 = %d, dck_dqs1 = %d, dck_dq0 = %d, dck_dq1 = %d\r\n", dck_dqs0, dck_dqs1, dck_dq0, dck_dq1);

	dram_odt_alwayson();

	/*FW set write delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	dck_pi += 64;
#if 1
	/*Scan dck hold time window*/
	while (count_hold < 64) {
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, dck_pi << DPI_SHIFT_POST_PI_SEL0, DPI_MASK_POST_PI_SEL0);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (dck_pi - dck_dqs0) << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (dck_pi - dck_dqs1) << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, (dck_pi - dck_dq0) << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, (dck_pi - dck_dq1) << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);
		//dbg_printf("dck_pi = %x\r\n", dck_pi);
		//dbg_printf("dpi_dev_map->DPI_PLL_PI0 = %x\r\n", dpi_dev_map->DPI_PLL_PI0);
		//dbg_printf("dpi_dev_map->DPI_PLL_PI1 = %x\r\n", dpi_dev_map->DPI_PLL_PI1);
		//dbg_printf("dpi_dev_map->DPI_PLL_PI2 = %x\r\n", dpi_dev_map->DPI_PLL_PI2);

		/*FW set write delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			/*Shift back to initial value*/
			dck_pi -= count_hold;
			break;
		} else {
			dbg_printf("dck_pi %d pass\r\n", dck_pi % 32);
		}

		if (count_hold >= 32) {
			break;
		}

		dck_pi++;
		count_hold++;
	}

	dbg_printf("dck hold window = %d ~ %d \r\n", (dck_pi % 32), (dck_pi % 32) + count_hold - 1);
#else
	/*Scan dck setup time window*/
	while (count_setup < 64) {
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, dck_pi << DPI_SHIFT_POST_PI_SEL0, DPI_MASK_POST_PI_SEL0);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (dck_pi - dck_dqs0) << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (dck_pi - dck_dqs1) << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, (dck_pi - dck_dq0) << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, (dck_pi - dck_dq1) << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);

		/*FW set write delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			/*Shift back to initial value*/
			dck_pi += count_setup;
			break;
		} else {
			dbg_printf("dck_pi %d pass\r\n", dck_pi % 32);
		}

		if (count_setup >= 32) {
			break;
		}

		dck_pi--;
		count_setup++;
	}

	dbg_printf("dck setup window = %d ~ %d \r\n", (dck_pi % 32) - count_setup + 1, (dck_pi % 32));
#endif

	/*Update when no read*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x0 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);
}

void dram_calibration_dcs_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 dcs_pi;
	u32 count_hold = 0;
	u32 count_setup = 0;

	dcs_pi = (dpi_dev_map->DPI_PLL_PI2 & DPI_MASK_POST_PI_SEL10) >> DPI_SHIFT_POST_PI_SEL10;

#if 1
	/*Scan dck hold time window*/
	while (count_hold < 32) {
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, dcs_pi << DPI_SHIFT_POST_PI_SEL10, DPI_MASK_POST_PI_SEL10);

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

		/*FW set write delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			/*Shift back to initial value*/
			dcs_pi -= count_hold;
			break;
		} else {
			dbg_printf("cs_pi %d pass\r\n", dcs_pi);
		}

