swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
		dcs_pi++;
		count_hold++;
	}

	dbg_printf("dcs_pi hold window = %d ~ %d \r\n", dcs_pi, dcs_pi + count_hold - 1);
#else
	/*Scan dck setup time window*/
	while (count_setup < 32) {
		cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, dcs_pi << DPI_SHIFT_POST_PI_SEL10, DPI_MASK_POST_PI_SEL10);

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

		/*FW set write delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			/*Shift back to initial value*/
			dcs_pi += count_setup;
			break;
		} else {
			dbg_printf("cs_pi %d pass\r\n", dcs_pi);
		}

		dcs_pi--;
		count_setup++;
	}

	dbg_printf("dcs_pi setup window = %d ~ %d \r\n", dcs_pi - count_setup + 1, dcs_pi);
#endif

	/*Update when no read*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x0 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);
}

void dram_calibration_dqs_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 dqspi_init[2];
	u32 dqspi_hold[2];
	u32 dqspi_setup[2];
	u32 count_hold = 0;
	u32 count_setup = 0;
	u32 slice = 0;
	u32 pi_count = 0;
	u32 index = 0;

	dqspi_init[0] = (dpi_dev_map->DPI_PLL_PI0 & DPI_MASK_POST_PI_SEL2) >> DPI_SHIFT_POST_PI_SEL2;
	dqspi_init[1] = (dpi_dev_map->DPI_PLL_PI0 & DPI_MASK_POST_PI_SEL3) >> DPI_SHIFT_POST_PI_SEL3;

	for (slice = 0; slice < 2; slice++) {
		count_hold = 0;
		count_setup = 0;

		/*DQS hold time scan*/
		for (pi_count = dqspi_init[slice]; pi_count < (dqspi_init[slice] + 16); pi_count++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, pi_count << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, pi_count << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

			if (dram_access_test() == _FAIL) {
				/*Shift back to initial value*/
				dqspi_hold[slice] = pi_count - 1;
				break;
			} else {
				dbg_printf("slice = %d, hold pi_count %d ~ %d pass\r\n", slice, dqspi_init[slice], pi_count);
			}

			count_hold++;
		}

		/*Shift back hold time to initial value*/
		for (index = 1; index <= count_hold; index++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (pi_count - index) << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (pi_count - index) << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		}

		/*DQS setup time scan*/
		for (pi_count = dqspi_init[slice] + 32; pi_count > (dqspi_init[slice] + 16); pi_count--) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, pi_count << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, pi_count << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

			if (dram_access_test() == _FAIL) {
				/*Shift back to initial value*/
				dqspi_setup[slice] = pi_count + 1;
				break;
			} else {
				dbg_printf("slice = %d, setup pi_count %d ~ %d pass\r\n", slice, dqspi_init[slice], pi_count);
			}

			count_setup++;
		}

		/*Shift back hold time to initial value*/
		for (index = 1; index <= count_setup; index++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (pi_count + index) << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, (pi_count + index) << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		}
	}

	dbg_printf("Slice 0 hold_count = %d, setup_count = %d, Slice 1 hold_count = %d, setup_count = %d\r\n",
			   dqspi_hold[0] % 32, dqspi_setup[0] % 32, dqspi_hold[1] % 32, dqspi_setup[1] % 32);
}

void dram_calibration_dq_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 dqpi_init[2];
	u32 dqpi_hold[2];
	u32 dqpi_setup[2];
	u32 count_hold = 0;
	u32 count_setup = 0;
	u32 slice = 0;
	u32 pi_count = 0;
	u32 index = 0;

	dqpi_init[0] = (dpi_dev_map->DPI_PLL_PI1 & DPI_MASK_POST_PI_SEL6) >> DPI_SHIFT_POST_PI_SEL6;
	dqpi_init[1] = (dpi_dev_map->DPI_PLL_PI2 & DPI_MASK_POST_PI_SEL7) >> DPI_SHIFT_POST_PI_SEL7;

	for (slice = 0; slice < 2; slice++) {
		count_hold = 0;
		count_setup = 0;

		/*DQS hold time scan*/
		for (pi_count = dqpi_init[slice]; pi_count < (dqpi_init[slice] + 16); pi_count++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, pi_count << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, pi_count << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

			if (dram_access_test() == _FAIL) {
				/*Shift back to initial value*/
				dqpi_hold[slice] = pi_count - 1;
				break;
			} else {
				dbg_printf("slice = %d, hold pi_count %d ~ %d pass\r\n", slice, dqpi_init[slice], pi_count);
			}

			count_hold++;
		}

