swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
		/*Shift back hold time to initial value*/
		for (index = 1; index <= count_hold; index++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, (pi_count - index) << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, (pi_count - index) << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		}

		/*DQS setup time scan*/
		for (pi_count = dqpi_init[slice] + 32; pi_count > (dqpi_init[slice] + 16); pi_count--) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, pi_count << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, pi_count << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

			if (dram_access_test() == _FAIL) {
				/*Shift back to initial value*/
				dqpi_setup[slice] = pi_count + 1;
				break;
			} else {
				dbg_printf("slice = %d, setup pi_count %d ~ %d pass\r\n", slice, dqpi_init[slice], pi_count);
			}

			count_setup++;
		}

		/*Shift back hold time to initial value*/
		for (index = 1; index <= count_setup; index++) {
			if (slice == 0) {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, (pi_count + index) << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
			} else {
				cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, (pi_count + index) << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);
			}

			/*Update immediately*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

			/*FW set write delay chain of data slice*/
			dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);
		}
	}

	dbg_printf("Slice 0 hold_count = %d, setup_count = %d, Slice 1 hold_count = %d, setup_count = %d\r\n",
			   dqpi_hold[0] % 32, dqpi_setup[0] % 32, dqpi_hold[1] % 32, dqpi_setup[1] % 32);
}

void dram_calibration_rx_dqsen_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 dqsen_init[2];
	u32 dqs_int[2];
	u32 dqsen_hold[2];
	u32 dqsen_delay_hold[2];
	u32 dqsen0_to_dqsen1;
	u32 dqsen;
	u32 dqsen_dly;
	u32 index;

	/*Initialize*/
	for (index = 0; index < 2; index++) {
		dqsen_hold[index] = 0xFF;
		dqsen_delay_hold[index] = 0xFF;
	}

	dqsen_init[0] = dpi_dev_map->DPI_READ_CTRL_0_0 & (DPI_MASK_TM_DQS_EN | DPI_MASK_TM_DQS_EN_FTUN);
	dqsen_init[1] = dpi_dev_map->DPI_READ_CTRL_0_1 & (DPI_MASK_TM_DQS_EN | DPI_MASK_TM_DQS_EN_FTUN);
	dqsen0_to_dqsen1 = dqsen_init[0] - dqsen_init[1];

	dpi_dev_map->DPI_READ_CTRL_4 |= DPI_BIT_FW_DQSEN_FTUN_UPD;
	dpi_dev_map->DPI_READ_CTRL_4_1 |= DPI_BIT_FW_DQSEN_FTUN_UPD;

	/*Set dqsen delay to 0*/
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, 0, DPI_MASK_DQS_EN_DLY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, 0, DPI_MASK_DQS_EN_DLY_SEL);

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	/*Scan dqsen*/
	for (dqsen = dqsen_init[0]; dqsen < 16; dqsen++) {
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, dqsen, (DPI_MASK_TM_DQS_EN | DPI_MASK_TM_DQS_EN_FTUN));
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, dqsen - dqsen0_to_dqsen1, (DPI_MASK_TM_DQS_EN | DPI_MASK_TM_DQS_EN_FTUN));

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			dbg_printf("dqsen = %d DRAM access test fail.\r\n", dqsen);
			/*Reset FIFO mode*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);

			/*Reset DQSEN mode*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);

			/*Reset 3Point mode*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);
			break;
		} else {
			dbg_printf("dqsen = %d DRAM access test pass.\r\n", dqsen);
		}

		dqs_int[0] = dpi_dev_map->DPI_INT_STATUS_0 & DPI_BIT_DQS_INT_0;
		dqs_int[1] = (dpi_dev_map->DPI_INT_STATUS_0 & DPI_BIT_DQS_INT_1) >> DPI_SHIFT_DQS_INT_1;

		/*Reset FIFO mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);

		/*Reset DQSEN mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);

		/*Reset 3Point mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);

