swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
		dbg_printf("dqsen = %d, dqs_int = %x\r\n", dqsen, (dpi_dev_map->DPI_INT_STATUS_0) & 0x3);

		cpu_read_modify_write(&dpi_dev_map->DPI_INT_CTRL, 0x3 << DPI_SHIFT_FW_CLR_DQS_INT, DPI_BIT_FW_CLR_DQS_INT | DPI_BIT_WRITE_EN_2);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_DQS_INT_0 | DPI_BIT_DQS_INT_1 | DPI_BIT_DQS_INT_2 | DPI_BIT_DQS_INT_3);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_TM_DQSEN_LATE_INT_0 | DPI_BIT_TM_DQSEN_LATE_INT_1 | DPI_BIT_TM_DQSEN_LATE_INT_2 | DPI_BIT_TM_DQSEN_LATE_INT_3);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_TM_DQSEN_EARLY_INT_0 | DPI_BIT_TM_DQSEN_EARLY_INT_1 | DPI_BIT_TM_DQSEN_EARLY_INT_2 | DPI_BIT_TM_DQSEN_EARLY_INT_3);
		cpu_read_modify_write(&dpi_dev_map->DPI_INT_CTRL, 0x2 << DPI_SHIFT_FW_CLR_DQS_INT, DPI_BIT_FW_CLR_DQS_INT | DPI_BIT_WRITE_EN_2);

		if ((dqs_int[0] == 1) && (dqsen_hold[0] == 0xFF)) {
			dqsen_hold[0] = dqsen - 1;
		}

		if ((dqs_int[1] == 1) && (dqsen_hold[1] == 0xFF)) {
			dqsen_hold[1] = dqsen - 1;
		}

		if ((dqsen_hold[0] != 0xFF) && (dqsen_hold[1] != 0xFF)) {
			break;
		}
	}

	/*Set dqsen to dqs_init boundary from scan*/
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, dqsen_hold[0], DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, dqsen_hold[1], DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);
#if 0
	for (dqsen_dly = 1; dqsen_dly < 64; dqsen_dly += 1) {
		/*Set dqsen to dqs_init boundary from scan*/
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, dqsen_dly << DPI_SHIFT_DQS_EN_DLY_SEL, DPI_MASK_DQS_FIFO_DLY_SEL);
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, dqsen_dly << DPI_SHIFT_DQS_EN_DLY_SEL, DPI_MASK_DQS_FIFO_DLY_SEL);

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			dbg_printf("dqsen_dly = %d DRAM access test fail.\r\n", dqsen_dly);
		} else {
			dbg_printf("dqsen_dly = %d DRAM access test pass.\r\n", dqsen_dly);
		}

		dqs_int[0] = dpi_dev_map->DPI_INT_STATUS_0 & DPI_BIT_DQS_INT_0;
		dqs_int[1] = (dpi_dev_map->DPI_INT_STATUS_0 & DPI_BIT_DQS_INT_1) >> DPI_SHIFT_DQS_INT_1;

		/*Reset FIFO mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);

		/*Reset DQSEN mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_DQSEN_MODE, DPI_MASK_RST_DQSEN_MODE);

		/*Reset 3Point mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x1 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x0 << DPI_SHIFT_RST_3POINT_MODE, DPI_MASK_RST_3POINT_MODE);

		dbg_printf("dqsen_dly = %d, dqs_int = %x\r\n", dqsen_dly, dpi_dev_map->DPI_INT_STATUS_0);

		cpu_read_modify_write(&dpi_dev_map->DPI_INT_CTRL, 0x3 << DPI_SHIFT_FW_CLR_DQS_INT, DPI_BIT_FW_CLR_DQS_INT | DPI_BIT_WRITE_EN_2);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_DQS_INT_0 | DPI_BIT_DQS_INT_1 | DPI_BIT_DQS_INT_2 | DPI_BIT_DQS_INT_3);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_TM_DQSEN_LATE_INT_0 | DPI_BIT_TM_DQSEN_LATE_INT_1 | DPI_BIT_TM_DQSEN_LATE_INT_2 | DPI_BIT_TM_DQSEN_LATE_INT_3);
		dpi_dev_map->DPI_INT_STATUS_0 &= ~(DPI_BIT_TM_DQSEN_EARLY_INT_0 | DPI_BIT_TM_DQSEN_EARLY_INT_1 | DPI_BIT_TM_DQSEN_EARLY_INT_2 | DPI_BIT_TM_DQSEN_EARLY_INT_3);
		cpu_read_modify_write(&dpi_dev_map->DPI_INT_CTRL, 0x2 << DPI_SHIFT_FW_CLR_DQS_INT, DPI_BIT_FW_CLR_DQS_INT | DPI_BIT_WRITE_EN_2);

		if ((dqs_int[0] == 1) && (dqsen_delay_hold[0] == 0xFF)) {
			dqsen_delay_hold[0] = dqsen_dly - 1;
		}

		if ((dqs_int[1] == 1) && (dqsen_delay_hold[1] == 0xFF)) {
			dqsen_delay_hold[1] = dqsen_dly - 1;
		}

		if ((dqsen_delay_hold[0] != 0xFF) && (dqsen_delay_hold[1] != 0xFF)) {
			break;
		}
	}

	/*Set dqsen_delay from scan*/
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, dqsen_delay_hold[0] << DPI_SHIFT_DQS_EN_DLY_SEL, DPI_MASK_DQS_FIFO_DLY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, dqsen_delay_hold[1] << DPI_SHIFT_DQS_EN_DLY_SEL, DPI_MASK_DQS_FIFO_DLY_SEL);

	/*Set dqsen to dqs_init boundary from scan, need to check value*/
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, dqsen_hold[0] - 1, DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, dqsen_hold[1] - 1, DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);
#endif
}

void dram_calibration_rx_fifo_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 fifo_init;
	u32 valid_fifo_max = 0;
	u32 valid_fifo_min;
	u32 fifo_index;


	fifo_init = dpi_dev_map->DPI_READ_CTRL1 & DPI_MASK_TM_RD_FIFO;
	valid_fifo_min = fifo_init;

	/*Disable 3 point calibration*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_CAL_SET_MODE, DPI_MASK_CAL_SET_MODE);

	for (fifo_index = fifo_init; fifo_index < 64; fifo_index++) {
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL1, fifo_index, DPI_MASK_TM_RD_FIFO);

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			dbg_printf("fifo_index = %d DRAM access test fail.\r\n", fifo_index);
			/*Reset FIFO mode*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
			break;
		} else {
			dbg_printf("fifo_index = %d DRAM access test pass.\r\n", fifo_index);
		}

		/*Reset FIFO mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
		valid_fifo_max = fifo_index;
	}

	/*Disable 3 point calibration*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_CAL_SET_MODE, DPI_MASK_CAL_SET_MODE);

	for (fifo_index = fifo_init - 1; fifo_index > 0; fifo_index--) {
		cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL1, fifo_index, DPI_MASK_TM_RD_FIFO);

		/*Update immediately*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

