swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
		/*FW set read delay chain of data slice*/
		dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

		if (dram_access_test() == _FAIL) {
			dbg_printf("fifo_index = %d DRAM access test fail.\r\n", fifo_index);
			/*Reset FIFO mode*/
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
			cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
			break;
		} else {
			valid_fifo_min = fifo_index;
			dbg_printf("fifo_index = %d DRAM access test pass.\r\n", fifo_index);
		}

		/*Reset FIFO mode*/
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
		cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_RST_FIFO_MODE, DPI_MASK_RST_FIFO_MODE);
	}

	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL1, valid_fifo_min + 1, DPI_MASK_TM_RD_FIFO);

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);
}

void dram_calibration_rx_dq_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u8 slice_index;
	u8 reg_index;
	u8 byte_index;

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);
	/*Disable 3 point calibration*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_CAL_SET_MODE, DPI_MASK_CAL_SET_MODE);

	//cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, 0x5 << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);
	//cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, 0x5 << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);

	for (slice_index = 0; slice_index < 2; slice_index++) {
		for (reg_index = 0; reg_index < 4; reg_index++) {
			for (byte_index = 0; byte_index < 4; byte_index++) {
				dram_scan_rd_dly(slice_index * 6 + reg_index, byte_index);
			}
		}
	}
}

void dram_calibration_tx_dq_map(void)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u8 reg_index;
	u8 shift_index;

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);
	/*Disable 3 point calibration*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x3 << DPI_SHIFT_CAL_SET_MODE, DPI_MASK_CAL_SET_MODE);

	for (reg_index = 0; reg_index < 4; reg_index++) {
		if ((reg_index == 0) || (reg_index == 1)) {
			for (shift_index = 0; shift_index < 8; shift_index++) {
				dram_scan_wr_dly(reg_index, shift_index);
			}
		} else {
			for (shift_index = 0; shift_index < 3; shift_index++) {
				//dram_scan_wr_dly(reg_index, shift_index);
			}

		}
	}
}

#endif

void dram_r480_calibration(u8 dram_type)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;

	DBG_DRAM_INFO("R480 K.\r\n");

	HAL_WRITE32(SYSON_S_BASE, 0x120, HAL_READ32(SYSON_S_BASE, 0x120) | (BIT19 | BIT22));

	dpi_dev_map->DPI_PAD_BUS_0 = 0x901B0000;

	if (dram_type == DDR_2) {
		/*vref_range_0[7]:28~92% = 0,vref_s_0[6:1],vref_pad_0[0] = 0*/
		cpu_read_modify_write(&dpi_dev_map->DPI_PAD_BUS_2, 0x4 << DPI_SHIFT_VREF_S_0, 0xFF);
	} else {
		/*vref_range_0[7]:0.5~63.5% = 0,vref_s_0[6:1] = 110111, vref_pad_0[0] = 0*/
		cpu_read_modify_write(&dpi_dev_map->DPI_PAD_BUS_2, (0x37 << DPI_SHIFT_VREF_S_0) | DPI_BIT_VREF_RANGE_0, 0xFF);
	}

	//dbg_printf("dpi_dev_map->DPI_PAD_BUS_2 = %x\r\n",dpi_dev_map->DPI_PAD_BUS_2);

	/*zq_ena_nocd2 = 0*/
	dpi_dev_map->DPI_ZQ_NOCD2 = 0x0;

	dpi_dev_map->DPI_PAD_CTRL_PROG = 0x3000C99;

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);////CHUN-CHI

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	hal_delay_us(10);

	/*R480 Calibration enable*/
	dpi_dev_map->DPI_PAD_CTRL_PROG = 0x3010C99;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_RZCTRL_STATUS & 0x1));

	DBG_DRAM_INFO("PAD_ZCTRL_STATUS = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_STATUS);
	DBG_DRAM_INFO("DPI_PAD_RZCTRL_STATUS = %x\r\n", dpi_dev_map->DPI_PAD_RZCTRL_STATUS);

	/*R480 Calibration disable*/
	dpi_dev_map->DPI_PAD_CTRL_PROG = 0x3000C99;
}

void dram_zq_calibration(u8 dram_type)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;

	DBG_DRAM_INFO("ZQ K.\r\n");

	/*Enable IBX current*/
	HAL_WRITE32(SYSON_S_BASE, 0x120, HAL_READ32(SYSON_S_BASE, 0x120) | (BIT19 | BIT22));

	dpi_dev_map->DPI_PAD_BUS_0 = 0x901B0000;

	if (dram_type == DDR_2) {
		/*vref_range[27]:28~92%,zq_vref[26:21]:50%*/
		cpu_read_modify_write(&dpi_dev_map->DPI_PAD_BUS_2, 0xC << DPI_SHIFT_VREF_S_0, 0xFF);
	} else {
		/*vref_range_0[7]:0.5~63.5% = 0,vref_s_0[6:1] = 110010, vref_pad_0[0] = 0*/
		cpu_read_modify_write(&dpi_dev_map->DPI_PAD_BUS_2, (0x32 << DPI_SHIFT_VREF_S_0) | DPI_BIT_VREF_RANGE_0, 0xFF);
	}

	/*zq_ena_nocd2 = 0*/
	dpi_dev_map->DPI_ZQ_NOCD2 = 0x0;

	/*auto update when calibration done*/
	dpi_dev_map->DPI_PAD_CTRL_PROG = 0xE000C99;

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);////CHUN-CHI

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	hal_delay_us(10);

	/*Enable auto update OCD/ODT set0*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x0, 0x70000000);

	/*OCD: 34, ODT: 120*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG = 0x14011E;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG = 0x11E;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set0 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set1*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x10000000, 0x70000000);

