swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_scan.c
	/*OCD: 40, ODT: 150*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_1 = 0x10003C;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_1 = 0x3C;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set1 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set2*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x20000000, 0x70000000);

	/*OCD: 60, ODT: 300*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_2 = 0x80100;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_2 = 0x100;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set2 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set3*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x30000000, 0x70000000);

	/*OCD: 50, ODT: 800*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_3 = 0x30030;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_3 = 0x30;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set3 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set4*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x40000000, 0x70000000);

	/*OCD: 32, ODT: 160*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_4 = 0xF0120;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_4 = 0x120;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set4 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set5*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x50000000, 0x70000000);

	/*OCD: 80, ODT: 75*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_5 = 0x20001E;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_5 = 0x1E;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set5 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	/*Enable auto update OCD/ODT set6*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PAD_CTRL_PROG, 0x60000000, 0x70000000);

	/*OCD: 50, ODT: 40*/
	dpi_dev_map->DPI_PAD_CTRL_ZPROG_6 = 0x3C0108;
	dpi_dev_map->DPI_PAD_NOCD2_ZPROG_6 = 0x108;

	/*Calibration start*/
	dpi_dev_map->DPI_PAD_CTRL_PROG |= DPI_BIT_ZCTRL_START;

	/*Wait Calibration done*/
	while (!(dpi_dev_map->DPI_PAD_ZCTRL_STATUS & BIT31));

	/*Disable Calibration*/
	dpi_dev_map->DPI_PAD_CTRL_PROG &= ~DPI_BIT_ZCTRL_START;
	DBG_DRAM_INFO("set6 PAD_ZCTRL_RESULT = %x\r\n", dpi_dev_map->DPI_PAD_ZCTRL_RESULT);

	dpi_dev_map->DPI_ODT_TTCP1_SET0 &= ~DPI_MASK_ODT_TTCP_SET_7_PRE;
	dpi_dev_map->DPI_ODT_TTCN1_SET0 &= ~DPI_MASK_ODT_TTCP_SET_7_PRE;
	dpi_dev_map->DPI_OCDP1_SET0 &= ~DPI_MASK_ODT_TTCP_SET_7_PRE;
	dpi_dev_map->DPI_OCDN1_SET0 &= ~DPI_MASK_ODT_TTCP_SET_7_PRE;
	dpi_dev_map->DPI_ODT_TTCP1_SET1 &= ~DPI_MASK_ODT_TTCP_SET_7;
	dpi_dev_map->DPI_ODT_TTCN1_SET1 &= ~DPI_MASK_ODT_TTCP_SET_7;
	dpi_dev_map->DPI_OCDP1_SET1 &= ~DPI_MASK_OCDP_SET_7;
	dpi_dev_map->DPI_OCDN1_SET1 &= ~DPI_MASK_OCDN_SET_7;
	dpi_dev_map->DPI_PAD_CTRL_PROG |= (DPI_BIT_DZQ_REF_UP | DPI_BIT_DZQ_AUTO_UP);

	/*Enable Power down after ZQ calibration done*/
	dpi_dev_map->DPI_PAD_BUS_1 |= BIT6;
	dpi_dev_map->DPI_PAD_BUS_0 |= BIT18;

	/*Disable IBX current*/
	HAL_WRITE32(SYSON_S_BASE, 0x120, HAL_READ32(SYSON_S_BASE, 0x120) & ~(BIT19 | BIT22));
}

void dram_set_pll_frequency(const unsigned short *pll_table)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 pll_ctl3_reg = 0;

	pll_ctl3_reg = ((pll_table[0] << DPI_SHIFT_CCO_BAND)
					| (pll_table[1] << DPI_SHIFT_CCO_KVCO)
					| (pll_table[2] << DPI_SHIFT_ICP)
					| (pll_table[3] << DPI_SHIFT_LOOP_PI_ISEL)
					| (pll_table[4] << DPI_SHIFT_LPF_CP)
					| (pll_table[5] << DPI_SHIFT_LPF_SR)
					| (pll_table[6] << DPI_SHIFT_PDIV)
					| (pll_table[7] << DPI_SHIFT_PLL_LDO_VSEL)
					| (pll_table[8] << DPI_SHIFT_PLL_SEL_CPMODE)
					| (pll_table[9] << DPI_SHIFT_POST_PI_BIAS)
					| (pll_table[10] << DPI_SHIFT_POST_PI_RL)
					| (pll_table[11] << DPI_SHIFT_POST_PI_RS)
					| (pll_table[12] << DPI_SHIFT_V11_LDO_VSEL));

	dpi_dev_map->DPI_PLL_CTL3 = pll_ctl3_reg;
	//dbg_printf("pll_ctl3_reg = %x\r\n", pll_ctl3_reg);
}

void dram_init_clk_frequency(uint32_t ddr_freq)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	//u32 n_code = 0, f_code = 0;
	//u32 rmw_data;

	//n_code = (ddr_freq / DDR_PLL_REF_CLK) - 3;
	//f_code = ((ddr_freq*1000 / DDR_PLL_REF_CLK) - (n_code + 3)*1000)*2048/1000;

	/*Disable Spread spectrum*/
	dpi_dev_map->DPI_SSC0 &= ~DPI_BIT_EN_SSC;//Spread spectrum 533
	//dbg_printf("&dpi_dev_map->DPI_SSC0 = %x\r\n", dpi_dev_map->DPI_SSC0);

	/*Down Spread -0.5%*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_SSC1, (0x1CC | (0x4 << DPI_SHIFT_DOT_GRAN)), DPI_MASK_GRAN_SET | DPI_MASK_DOT_GRAN);//Spread spectrum 533
	/*Down Spread -3%*/
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC1, (0xAD0 | (0x4 << DPI_SHIFT_DOT_GRAN)), DPI_MASK_GRAN_SET | DPI_MASK_DOT_GRAN);//Spread spectrum 533
	//dbg_printf("&dpi_dev_map->DPI_SSC1 = %x\r\n", dpi_dev_map->DPI_SSC1);

	/*No Spread spectrum*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_SSC2, (f_code | (f_code << DPI_SHIFT_F_CODE_T), DPI_MASK_F_CODE | DPI_MASK_F_CODE_T);
	/*Down Spread -0.5%*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_SSC2, (0x222 | (0x2AA << DPI_SHIFT_F_CODE_T)), DPI_MASK_F_CODE | DPI_MASK_F_CODE_T);//Spread spectrum 533
	/*Down Spread -3%*/
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC2, (0x777 | (0x2AA << DPI_SHIFT_F_CODE_T)), DPI_MASK_F_CODE | DPI_MASK_F_CODE_T);//Spread spectrum 533
	//dbg_printf("&dpi_dev_map->DPI_SSC2 = %x\r\n", dpi_dev_map->DPI_SSC2);

	/*No Spread spectrum*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, (n_code | (n_code << DPI_SHIFT_N_CODE_T)), DPI_MASK_N_CODE | DPI_MASK_N_CODE_T);
	/*Down Spread -0.5%*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, (0xA | (0xA << DPI_SHIFT_N_CODE_T)), DPI_MASK_N_CODE | DPI_MASK_N_CODE_T);//Spread spectrum 533
	/*Down Spread -3%*/
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, (0x9 | (0xA << DPI_SHIFT_N_CODE_T)), DPI_MASK_N_CODE | DPI_MASK_N_CODE_T);//Spread spectrum 533
	//dbg_printf("&dpi_dev_map->DPI_SSC3 = %x\r\n", dpi_dev_map->DPI_SSC3);

	/*Enable Spread spectrum*/
	dpi_dev_map->DPI_SSC0 |= (DPI_BIT_EN_SSC | DPI_BIT_SSC_FLAG_INIT);//Spread spectrum 533
	//dbg_printf("&dpi_dev_map->DPI_SSC0 = %x\r\n", dpi_dev_map->DPI_SSC0);

	//dbg_printf("n_cdoe = %d, f_code = %d\r\n", n_code, f_code);
}

